Тест1/src/Catalogs/РучныеКатегории/РучныеКатегории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РучныеКатегории</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Порядок1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kodpodkat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбщее</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеСкания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДАФ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМАН</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВольво</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автолайн</name>
    <type>
      <types>CatalogRef.CatAutoline</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеДляОписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>допкат</name>
    <attributes>
      <name>ДопКатегория</name>
      <type>
        <types>CatalogRef.РучныеКатегории</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>допкат2</name>
    <attributes>
      <name>код</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.РучныеКатегории</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/Категории/Категории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Категории</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Порядок1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kodpodkat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбщее</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеСкания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДАФ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМАН</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВольво</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автолайн</name>
    <type>
      <types>CatalogRef.CatAutoline</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеДляОписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>допкат</name>
    <attributes>
      <name>ДопКатегория</name>
      <type>
        <types>CatalogRef.Категории</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>допкат2</name>
    <attributes>
      <name>код</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.Категории</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/РучныеКатегории/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
КонецПроцедуры

&НаКлиенте
Процедура допкатПередУдалением(Элемент, Отказ)
  УдалитьДопкат(Элемент.ТекущиеДанные.ДопКатегория);	
КонецПроцедуры

&НаСервере
Процедура УдалитьДопкат(ссыл)
	
	Для Каждого стр из Объект.допкат Цикл
		Для Каждого стр2 Из стр.ДопКатегория.допкат Цикл
			Если стр2.ДопКатегория = ссыл Тогда
				об = стр.ДопКатегория.ПолучитьОбъект();
				Для Каждого стр3 из об.допкат Цикл
					Если стр3.ДопКатегория = стр2.ДопКатегория Тогда
						об.допкат.Удалить(стр3);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				об.Записать();
			КонецЕсли;
			Если ссыл = стр.ДопКатегория И стр2.ДопКатегория = Объект.Ссылка Тогда
				об = стр.ДопКатегория.ПолучитьОбъект();
				Для Каждого стр3 из об.допкат Цикл
					Если стр3.ДопКатегория = стр2.ДопКатегория Тогда
						об.допкат.Удалить(стр3);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				об.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	обновитьКат();
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаСервере
Процедура обновитьКат()
	о = Объект.Ссылка.ПолучитьОбъект();
	категории = Новый Массив;
	категории.Добавить(о.Код);
	Для Каждого стр Из о.допкат Цикл
		Если категории.Найти(стр.ДопКатегория.Код) = Неопределено Тогда
			категории.Добавить(стр.ДопКатегория.Код);
		КонецЕсли;
		Для Каждого стр2 Из стр.ДопКатегория.допкат Цикл
			Если категории.Найти(стр2.ДопКатегория.Код) = Неопределено Тогда
				категории.Добавить(стр2.ДопКатегория.Код);
			КонецЕсли
		КонецЦикла;
	КонецЦикла;
	Для Каждого кд Из категории Цикл
		
		Если кд = о.Код Тогда
			об = о;
		Иначе
			об = Справочники.Категории.НайтиПоКоду(кд).ПолучитьОбъект();
		КонецЕсли;
		
		Для Каждого кд2 Из категории Цикл
			Если кд2 <> об.Код Тогда
				найдено = ложь;
				Для Каждого стр Из об.допкат Цикл
					Если стр.ДопКатегория.Код = кд2 Тогда
						найдено = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если найдено = Ложь Тогда
					об2 = Справочники.Категории.НайтиПоКоду(кд2);
					стртаб = об.допкат.Добавить();
					стртаб.ДопКатегория = об2;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если кд <> объект.Код Тогда
			об.Записать();
		КонецЕсли;
	КонецЦикла;
	о.Записать();
КонецПроцедуры

&НаКлиенте
Процедура допкат2ПриИзменении(Элемент)
	ид = Новый УникальныйИдентификатор;
	ид2 = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Если Элемент.ТекущиеДанные.код = ид2 Тогда
		Элемент.ТекущиеДанные.код = ид;
	КонецЕсли;
КонецПроцедуры
